rocksdb/experiments/M2/results/20260429-020219/budget_off/run_3/db_bench.log
RocksDB:    version 8.11.3
Date:       Wed Apr 29 02:16:58 2026
CPU:        16 * Intel(R) Xeon(R) Gold 5320 CPU @ 2.20GHz
CPUCache:   16384 KB
Set seed to 1777429018559524 because --seed was 0
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
Keys:       16 bytes each (+ 0 bytes user-defined timestamp)
Values:     1024 bytes each (512 bytes after compression)
Entries:    5000000
Prefix:    0 bytes
Keys per prefix:    0
RawSize:    4959.1 MB (estimated)
FileSize:   2517.7 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: NoCompression
Compression sampling rate: 0
Memtablerep: SkipListFactory
Perf Level: 1
------------------------------------------------
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
DB path: [rocksdbtest/dbbench]
fillrandom   :       8.401 micros/op 119034 ops/sec 42.005 seconds 5000000 operations;  118.1 MB/s
DB path: [rocksdbtest/dbbench]
overwrite    :      11.839 micros/op 84463 ops/sec 59.197 seconds 5000000 operations;   83.8 MB/s
DB path: [rocksdbtest/dbbench]
overwrite    :      11.691 micros/op 85539 ops/sec 58.453 seconds 5000000 operations;   84.8 MB/s


** Compaction Stats [default] **
Level    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  L0      7/0   435.93 MB   1.8      0.0     0.0      0.0      14.6     14.6       0.0   1.0      0.0    496.7     30.09             22.65       240    0.125       0      0       0.0       0.0
  L1     27/1    1.62 GB   6.3     26.3    14.2     12.1      23.1     11.0       0.0   1.6    278.7    245.4     96.55             80.65        19    5.082     26M  3192K       0.0       0.0
  L2     90/2    4.49 GB   1.8     20.4     8.8     11.5      15.4      3.9       0.6   1.7    348.4    264.3     59.85             48.56       133    0.450     20M  5003K       0.0       0.0
 Sum    124/3    6.54 GB   0.0     46.6    23.0     23.6      53.2     29.6       0.6   3.6    256.1    292.0    186.49            151.86       392    0.476     47M  8196K       0.0       0.0
 Int      0/0    0.00 KB   0.0     46.4    22.8     23.6      52.5     28.9       0.6   3.7    257.0    290.9    184.84            150.49       384    0.481     47M  8191K       0.0       0.0

** Compaction Stats [default] **
Priority    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 Low      0/0    0.00 KB   0.0     46.6    23.0     23.6      38.6     15.0       0.0   0.0    305.4    252.6    156.40            129.21       152    1.029     47M  8196K       0.0       0.0
High      0/0    0.00 KB   0.0      0.0     0.0      0.0      14.6     14.6       0.0   0.0      0.0    496.7     30.09             22.65       240    0.125       0      0       0.0       0.0

Blob file count: 0, total size: 0.0 GB, garbage size: 0.0 GB, space amp: 0.0

Uptime(secs): 159.7 total, 156.7 interval
Flush(GB): cumulative 14.598, interval 14.172
AddFile(GB): cumulative 0.000, interval 0.000
AddFile(Total Files): cumulative 0, interval 0
AddFile(L0 Files): cumulative 0, interval 0
AddFile(Keys): cumulative 0, interval 0
Cumulative compaction: 53.18 GB write, 341.07 MB/s write, 46.64 GB read, 299.11 MB/s read, 186.5 seconds
Interval compaction: 52.52 GB write, 343.28 MB/s write, 46.40 GB read, 303.27 MB/s read, 184.8 seconds
Write Stall (count): cf-l0-file-count-limit-delays-with-ongoing-compaction: 23, cf-l0-file-count-limit-stops-with-ongoing-compaction: 0, l0-file-count-limit-delays: 23, l0-file-count-limit-stops: 0, memtable-limit-delays: 0, memtable-limit-stops: 0, pending-compaction-bytes-delays: 0, pending-compaction-bytes-stops: 0, total-delays: 23, total-stops: 0
interval: 23 total count
Block cache LRUCache@0x55f82ec2fdf0#75894 capacity: 32.00 MB seed: 1900266532 usage: 0.09 KB table_size: 1024 occupancy: 1 collections: 1 last_copies: 1 last_secs: 0.000204 secs_since: 159
Block cache entry stats(count,size,portion): Misc(1,0.00 KB,0%)

** File Read Latency Histogram By Level [default] **

** DB Stats **
Uptime(secs): 159.7 total, 156.7 interval
Cumulative writes: 15M writes, 15M keys, 15M commit groups, 1.0 writes per commit group, ingest: 14.75 GB, 94.61 MB/s
Cumulative WAL: 15M writes, 0 syncs, 15000000.00 writes per sync, written: 14.75 GB, 94.61 MB/s
Cumulative stall: 00:00:56.649 H:M:S, 35.5 percent
Interval writes: 14M writes, 14M keys, 14M commit groups, 1.0 writes per commit group, ingest: 14590.19 MB, 93.13 MB/s
Interval WAL: 14M writes, 0 syncs, 14487619.00 writes per sync, written: 14.25 GB, 93.13 MB/s
Interval stall: 00:00:56.649 H:M:S, 36.2 percent
Write Stall (count): write-buffer-manager-limit-stops: 0